source/Documents/KadrovoyeIzmenenie.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>KadrovoyeIzmenenie</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.OtpravlennyeUvedomleniya</xr:Item>
				<xr:Item>AccumulationRegister.OshibkiOtpravkiUvedomleniy</xr:Item>
				<xr:Item>AccumulationRegister.KadrovyeSobytiya</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Sotrudnik</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Sotrudniki</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VidIzmeneniya</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VidyKadrovykhIzmeneniy</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TipIzmeneniya</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TipyKadrovykhIzmeneniy</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataIzmeneniya</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PodrazdelenieDo</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Podrazdeleniya</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PodrazdeleniePosle</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Podrazdeleniya</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DolzhnostDo</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Dolzhnosti</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DolzhnostPosle</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Dolzhnosti</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OkladDo</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OkladPosle</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Osnovanie</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Otvetstvennyy</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TrebuyetsyaUvedomleniye</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StatusUvedomleniya</Name>
					<Type>
						<v8:Type>cfg:EnumRef.StatusyUvedomleniy</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Kommentariy</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VKRManualRecipients</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VKRReason</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PrichinyKadrovykhIzmeneniy</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VKRSourceKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VidyDokumentovOsnovaniy</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Poluchateli</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Poluchatel</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.PoluchateliUvedomleniy</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Email</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Status</Name>
							<Type>
								<v8:Type>cfg:EnumRef.StatusyUvedomleniy</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Kommentariy</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

source/AccumulationRegisters/KadrovyeSobytiya.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>KadrovyeSobytiya</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Kolichestvo</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>DokumentOsnovanie</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.KadrovoyeIzmenenie</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Kommentariy</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Sotrudnik</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Sotrudniki</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>VidIzmeneniya</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VidyKadrovykhIzmeneniy</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Podrazdelenie</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Podrazdeleniya</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

source/AccumulationRegisters/OtpravlennyeUvedomleniya.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>OtpravlennyeUvedomleniya</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Kolichestvo</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TemaPisma</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DokumentOsnovanie</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.KadrovoyeIzmenenie</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Sotrudnik</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Sotrudniki</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>VidIzmeneniya</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VidyKadrovykhIzmeneniy</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Poluchatel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PoluchateliUvedomleniy</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.StatusyUvedomleniy</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Podrazdelenie</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Podrazdeleniya</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

source/AccumulationRegisters/OshibkiOtpravkiUvedomleniy.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>OshibkiOtpravkiUvedomleniy</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Kolichestvo</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>OpisanieOshibki</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DokumentOsnovanie</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.KadrovoyeIzmenenie</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Poluchatel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PoluchateliUvedomleniy</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>VidIzmeneniya</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VidyKadrovykhIzmeneniy</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Podrazdelenie</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Podrazdeleniya</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

source/Documents/KadrovoyeIzmenenie/Ext/ObjectModule.bsl
// Заменяет извлечённый модуль исходной версии после создания новых метаданных.
Процедура ОбработкаПроведения(Отказ, Режим)
    Если НЕ ЗначениеЗаполнено(Sotrudnik) Или НЕ ЗначениеЗаполнено(VidIzmeneniya)
        Или НЕ ЗначениеЗаполнено(DataIzmeneniya) Тогда
        Отказ = Истина;
        Сообщить("Заполните сотрудника, вид и дату кадрового изменения.");
        Возврат;
    КонецЕсли;
    Попытка
        VKRHR.ПроверитьСобытие(ЭтотОбъект);
        Движения.KadrovyeSobytiya.Записывать = Истина;
        Движения.KadrovyeSobytiya.Очистить();
        // Удаляются только старые движения этого кадрового документа.
        // Факты новой отправки имеют собственных регистраторов.
        Движения.OtpravlennyeUvedomleniya.Записывать = Истина;
        Движения.OtpravlennyeUvedomleniya.Очистить();
        Движения.OshibkiOtpravkiUvedomleniy.Записывать = Истина;
        Движения.OshibkiOtpravkiUvedomleniy.Очистить();
        Д = Движения.KadrovyeSobytiya.Добавить();
        Д.Период = DataIzmeneniya;
        Д.Sotrudnik = Sotrudnik;
        Д.VidIzmeneniya = VidIzmeneniya;
        Д.Podrazdelenie = ?(ЗначениеЗаполнено(PodrazdeleniePosle), PodrazdeleniePosle, PodrazdelenieDo);
        Д.Kolichestvo = 1;
        Д.DokumentOsnovanie = Ссылка;
        Д.Kommentariy = Kommentariy;
        VKROutbox.Подготовить(ЭтотОбъект);
    Исключение
        Отказ = Истина;
        Сообщить(ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
    Попытка
        VKROutbox.ОтменитьСобытие(Ссылка);
    Исключение
        Отказ = Истина;
        Сообщить(ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры
